# Multiply Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..Multiply Operator
Transform Class See Also
---
Multiplies the two specified transforms.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static Transform operator *(
	Transform left,
	Transform right
)
```

Visual Basic
---
```text
Public Shared Operator * ( _
	left As Transform, _
	right As Transform _
) As Transform
```

Visual C++
---
```text
public:
static Transform^ operator *(
	Transform^ left,
	Transform^ right
)
```

# ### Parameters
left
    Type: Autodesk.Revit.DB..::..TransformThe first transformation.
right
    Type: Autodesk.Revit.DB..::..TransformThe second transformation.
# ### Return Value
The transformation equal to the composition of the two transformations.
# Remarks
The combined transformation has the same effect as applying the right transformation first, and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the handle of the first or second transformation is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Transform Class
Autodesk.Revit.DB Namespace